Table of Contents
 Class Member1D
Namespace
IdeaRS.OpenModel.Model
Assembly
IdeaRS.OpenModel.dll
Representation of member1D
[OpenModelClass("CI.StructModel.Structure.Member1D,CI.StructuralElements", "CI.StructModel.Structure.IMember1D,CI.BasicTypes")]
public class Member1D : OpenElementId
Inheritance
object
OpenObject
OpenElementId
Member1D
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 Member1D()
Constructor
public Member1D()
Properties
 Alignment
Alignment of the member's cross-section. Eccentricities are added up to the alignment.
public Alignment Alignment { get; set; }
Property Value
Alignment
 CrossSection
Cross-section of the member.
public ReferenceElement CrossSection { get; set; }
Property Value
ReferenceElement
 Elements1D
Array of element1D
public List<ReferenceElement> Elements1D { get; set; }
Property Value
List<ReferenceElement>
List of Element1D
 HingeBegin
Gets, sets hinge located in the begining of element
public ReferenceElement HingeBegin { get; set; }
Property Value
ReferenceElement
 HingeEnd
Gets, sets hinge located in the end of element
public ReferenceElement HingeEnd { get; set; }
Property Value
ReferenceElement
 Member1DType
Beam, column,...
public Member1DType Member1DType { get; set; }
Property Value
Member1DType
 MirrorY
Mirrors the cross-section of this member on the Y-axis.
public bool MirrorY { get; set; }
Property Value
bool
 MirrorZ
Mirrors the cross-section of this member on the Z-axis.
public bool MirrorZ { get; set; }
Property Value
bool
 Name
Name of Element
public string Name { get; set; }
Property Value
string
 Taper
Taper for defining haunched member.
public ReferenceElement Taper { get; set; }
Property Value
ReferenceElement
 Edit this page